{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "dtype": "float32", "activation": "tanh", "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 64, "use_bias": true, "batch_input_shape": [null, 64], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 32, "use_bias": true, "name": "dense_2", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 16, "use_bias": true, "name": "dense_3", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "units": 3, "use_bias": true, "name": "dense_4", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}], "keras_version": "2.0.8"}